In [1]:
import sqlite3
import pandas as pd

In [2]:
##Establish connection to db
connection=sqlite3.connect('Emplyees1.db')

In [3]:
## create cursor object
cursor = connection.cursor()

In [4]:
## create table if it doesnot exist
cursor.execute('''CREATE TABLE IF NOT EXISTS Employees1(ID INTEGER PRIMARY KEY AUTOINCREMENT,Name TEXT, Age INTEGER)''')

In [5]:
##Insert a record into table employees
cursor.execute('''INSERT INTO Employees1 (Name, Age) VALUES ('Rupa',23),('Ana',23),('Blake',22)''')

In [6]:
connection.commit()

In [7]:
#get records from table

In [8]:
cursor.execute("SELECT * FROM Employees1")

In [9]:
#Get the data into dataframe
rows=cursor.fetchall()
rows

[(1, 'Rupa', 23),
 (2, 'Ana', 23),
 (3, 'Blake', 22),
 (4, 'Rupa', 23),
 (5, 'Ana', 23),
 (6, 'Blake', 22),
 (7, 'Rupa', 23),
 (8, 'Ana', 23),
 (9, 'Blake', 22)]

In [10]:
#OR
for row in rows:
    print(row)

(1, 'Rupa', 23)
(2, 'Ana', 23)
(3, 'Blake', 22)
(4, 'Rupa', 23)
(5, 'Ana', 23)
(6, 'Blake', 22)
(7, 'Rupa', 23)
(8, 'Ana', 23)
(9, 'Blake', 22)

In [11]:
#Using read sql query
df = pd.read_sql("SELECT * FROM Employees1",connection)
df

   ID   Name  Age
0   1   Rupa   23
1   2    Ana   23
2   3  Blake   22
3   4   Rupa   23
4   5    Ana   23
5   6  Blake   22
6   7   Rupa   23
7   8    Ana   23
8   9  Blake   22

In [12]:
#JSON

import requests
import json

In [17]:
url = "https://api.thecatapi.com/v1/images/%C2%AEXYvRd7oD"

In [18]:
response=requests.get(url)
response

In [20]:
data = response.json()
data

Error: Response is not valid JSON or is empty.
Response Status Code: 400
Response Text: Couldn't find an image matching the passed 'id' of Â®XYvRd7oD

In [ ]:

## Optional if you to see the image